docs/dev-notes/html/windows_deployment.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-10 Sa 12:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Windows Deployment</title>
<meta name="author" content="MU" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../org/styles.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">Windows Deployment</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org58c0bfe">Useful Documents</a></li>
<li><a href="#org9ed5a99">Summary</a></li>
<li><a href="#org4b63653">Build Instructions</a>
<ul>
<li><a href="#orgf174857">PySSA-Installer</a></li>
<li><a href="#org8a1ff08">ColabFold/AlamaLinux</a>
<ul>
<li><a href="#org078a0ba">Resources</a></li>
</ul>
</li>
<li><a href="#org89fe323">PySSA-Plug-in</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org58c0bfe" class="outline-2">
<h2 id="org58c0bfe">Useful Documents</h2>
<div class="outline-text-2" id="text-org58c0bfe">
<ul class="org-ul">
<li><a href="central_station.html">Central Station</a></li>
</ul>
</div>
</div>

<div id="outline-container-org9ed5a99" class="outline-2">
<h2 id="org9ed5a99">Summary</h2>
<div class="outline-text-2" id="text-org9ed5a99">
<p>
This document describes the Windows deployment and all related tasks.
</p>
</div>
</div>

<div id="outline-container-org4b63653" class="outline-2">
<h2 id="org4b63653">Build Instructions</h2>
<div class="outline-text-2" id="text-org4b63653">
</div>
<div id="outline-container-orgf174857" class="outline-3">
<h3 id="orgf174857">PySSA-Installer</h3>
<div class="outline-text-3" id="text-orgf174857">
<ol class="org-ol">
<li>Change version number in source code, under Constants.cs!</li>
<li>Publish WPF application through Visual Studio 2022 in a directory (there is a publishing profile).</li>
<li>Copy the build files (.exe and .pdb) to inno setup src directory (there is a batch script).</li>
<li>Open Inno Script Studio and the installer.iss file.</li>
<li>Change the version number in the script file.</li>
<li>Build the inno setup .exe file.</li>
<li>Move the setup .exe to sciebo under the \sciebo\pyssa\installer directory</li>
<li>Change version number in \sciebo\pyssa\installer directory\latest<sub>version.txt</sub> file.</li>
<li>Build and distribution of PySSA-Installer process is finished.</li>
</ol>
</div>
</div>

<div id="outline-container-org8a1ff08" class="outline-3">
<h3 id="org8a1ff08">ColabFold/AlamaLinux</h3>
<div class="outline-text-3" id="text-org8a1ff08">
<p>
Build image using alama linux DOCKERFILE:
</p>
<div class="org-src-container">
<pre class="src src-shell">podman build -f path/to/dockerfile -t almacolabfold9:1.5.1.2
</pre>
</div>

<p>
Create rootfs for wsl:
</p>
<div class="org-src-container">
<pre class="src src-shell">podman run --name almacolabfold9 almacolabfold:1.5.1.2
</pre>
</div>
<div class="org-src-container">
<pre class="src src-shell">podman export -o alama-colabfold-9-rootfs.tar almacolabfold9
</pre>
</div>

<p>
Import image into wsl:
</p>
<div class="org-src-container">
<pre class="src src-shell">wsl --import almaColabfold9 path/to/wsl/storage path/to/tarfile
</pre>
</div>
<div class="org-src-container">
<pre class="src src-shell">wsl --import almaColabfold9 C:\Users\martin\user_space\inno_setup\local_colabfold\src\tmp_storage C:\Users\martin\user_space\inno_setup\local_colabfold\src\alma-colabfold-9-rootfs.tar
</pre>
</div>

<p>
Run install script of localcolabfold:
</p>
<div class="org-src-container">
<pre class="src src-shell">/home/rhel_user/localcolabfold/colabfold-conda/bin/colabfold_batch /mnt/c/Users/student/.pyssa/scratch/local_prediction/fasta /mnt/c/Users/student/.pyssa/scratch/local_prediction/pdb
</pre>
</div>
</div>

<div id="outline-container-org078a0ba" class="outline-4">
<h4 id="org078a0ba">Resources</h4>
<div class="outline-text-4" id="text-org078a0ba">
<ul class="org-ul">
<li><a href="https://hub.docker.com/_/almalinux">https://hub.docker.com/_/almalinux</a></li>
<li><a href="https://dev.to/bowmanjd/install-fedora-on-windows-subsystem-for-linux-wsl-4b26">https://dev.to/bowmanjd/install-fedora-on-windows-subsystem-for-linux-wsl-4b26</a></li>
<li><a href="https://github.com/containers/podman/blob/main/pkg/machine/wsl/machine.go#L818">https://github.com/containers/podman/blob/main/pkg/machine/wsl/machine.go#L818</a></li>
<li><a href="https://github.com/containers/podman/blob/main/pkg/machine/wsl/wutil/wutil.go">https://github.com/containers/podman/blob/main/pkg/machine/wsl/wutil/wutil.go</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org89fe323" class="outline-3">
<h3 id="org89fe323">PySSA-Plug-in</h3>
<div class="outline-text-3" id="text-org89fe323">
<ol class="org-ol">
<li>Change version number in constants.py</li>
<li>Build pyssa with the batch script into a windows<sub>package.zip</sub></li>
<li>Upload windows<sub>package.zip</sub> to sciebo</li>
<li>Change version number in versions.txt in sciebo!</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: MU</p>
<p class="date">Created: 2024-02-10 Sa 12:13</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
